OpenNuvoton/NUC970_NuWriter/NuWriterFW/NuWriterFW/source/sm.c
#include <string.h>
#include <stdlib.h>
#include "NUC970_reg.h"
#include "usbd.h"
#include "fmi.h"
#include "wblib.h"
#include "wbfmi.h"
#include "sd.h"

/*-----------------------------------------------------------------------------
 * Define some constants for BCH
 *---------------------------------------------------------------------------*/
// define the total padding bytes for 512/1024 data segment
#define BCH_PADDING_LEN_512     32
#define BCH_PADDING_LEN_1024    64
// define the BCH parity code lenght for 512 bytes data pattern
#define BCH_PARITY_LEN_T4  8
#define BCH_PARITY_LEN_T8  15
#define BCH_PARITY_LEN_T12 23
#define BCH_PARITY_LEN_T15 29
// define the BCH parity code lenght for 1024 bytes data pattern
#define BCH_PARITY_LEN_T24 45

#define ERASE_WITH_0XF0
/*-----------------------------------------------------------------------------*/

// global variables
UCHAR _fmi_ucBaseAddr1=0, _fmi_ucBaseAddr2=0;
FMI_SM_INFO_T SMInfo, *pSM;
FW_UPDATE_INFO_T FWInfo;
extern int volatile _usbd_IntraROM;
extern void SendAck(UINT32 status);

INT fmiSMCheckRB()
{
    int volatile tick;

    tick = sysGetTicks(TIMER0);
    while(1)
    {
        if (inpw(REG_SMISR) & 0x400)
        {
            while(! (inpw(REG_SMISR) & 0x40000) );
            outpw(REG_SMISR, 0x400);
            return 1;
        }
        if ((sysGetTicks(TIMER0) - tick) > 2)
            return 0;
    }
}

// SM functions
INT fmiSM_Reset(void)
{
    UINT32 volatile i;
    outpw(REG_SMCMD, 0xff);
    for (i=100; i>0; i--);
    if (!fmiSMCheckRB())
        return Fail;
    return Successful;
}


VOID fmiSM_Initial(FMI_SM_INFO_T *pSM)
{
	outpw(REG_SMCSR,  inpw(REG_SMCSR) | 0x800080);	// enable ECC

    //--- Set register to disable Mask ECC feature
    outpw(REG_SMREACTL, inpw(REG_SMREACTL) & ~0xffff0000);

	//--- Set registers that depend on page size. According to FA95 sepc, the correct order is
	//--- 1. SMCR_BCH_TSEL  : to support T24, MUST set SMCR_BCH_TSEL before SMCR_PSIZE.
	//--- 2. SMCR_PSIZE     : set SMCR_PSIZE will auto change SMRE_REA128_EXT to default value.
	//--- 3. SMRE_REA128_EXT: to use non-default value, MUST set SMRE_REA128_EXT after SMCR_PSIZE.
    outpw(REG_SMCSR, (inpw(REG_SMCSR) & ~0x7c0000) | pSM->uNandECC);
	if (pSM->uPageSize == 8192)
		outpw(REG_SMCSR, (inpw(REG_SMCSR)&(~0x30000)) | 0x30000);
	else if (pSM->uPageSize == 4096)
		outpw(REG_SMCSR, (inpw(REG_SMCSR)&(~0x30000)) | 0x20000);
	else if (pSM->uPageSize == 2048)
   		outpw(REG_SMCSR, (inpw(REG_SMCSR)&(~0x30000)) | 0x10000);
	else    // Page size should be 512 bytes
   		outpw(REG_SMCSR, (inpw(REG_SMCSR)&(~0x30000)) | 0x00000);
    outpw(REG_SMREACTL, (inpw(REG_SMREACTL) & ~0x1ff) | pSM->uSpareSize);

    //TODO: if need protect --- config register for Region Protect
    outpw(REG_SMCSR, inpw(REG_SMCSR) & ~0x20);   // disable Region Protect

    // Disable Write Protect
    outpw(REG_NFECR, 0x01);
}

UINT32 Custom_uBlockPerFlash;
UINT32 Custom_uPagePerBlock;
INT fmiSM_ReadID(FMI_SM_INFO_T *pSM)
{
    UINT32 tempID[5],u32PowerOn,IsID=0;

    if (pSM->bIsInResetState == FALSE)
    {
        if (fmiSM_Reset() < 0)
            return Fail;
        pSM->bIsInResetState = TRUE;
    }
    pSM->bIsInResetState = FALSE;
    outpw(REG_SMCMD, 0x90);     // read ID command
    outpw(REG_SMADDR, 0x80000000);  // address 0x00

    tempID[0] = inpw(REG_SMDATA);
    tempID[1] = inpw(REG_SMDATA);
    tempID[2] = inpw(REG_SMDATA);
    tempID[3] = inpw(REG_SMDATA);
    tempID[4] = inpw(REG_SMDATA);
    
    MSG_DEBUG("ID[0]=0x%2x, ID[1]=0x%2x\n",tempID[0], tempID[1]);
    MSG_DEBUG("ID[2]=0x%2x, ID[3]=0x%2x\n",tempID[2], tempID[3]);
    MSG_DEBUG("ID[4]=0x%2x\n",tempID[4]);
    switch (tempID[1])
    {
        /* page size 512B */
        case 0x79:  // 128M
            pSM->uBlockPerFlash = 8191;
            pSM->uPagePerBlock = 32;
            pSM->uSectorPerBlock = 32;
            pSM->uPageSize = 512;
            pSM->uNandECC = BCH_T4;
            pSM->bIsMulticycle = TRUE;
            pSM->uSpareSize = 16;
            break;

        case 0x76:  // 64M
            pSM->uBlockPerFlash = 4095;
            pSM->uPagePerBlock = 32;
            pSM->uSectorPerBlock = 32;
            pSM->uPageSize = 512;
            pSM->uNandECC = BCH_T4;
            pSM->bIsMulticycle = TRUE;
            pSM->uSpareSize = 16;
            break;

        case 0x75:  // 32M
            pSM->uBlockPerFlash = 2047;
            pSM->uPagePerBlock = 32;
            pSM->uSectorPerBlock = 32;
            pSM->uPageSize = 512;
            pSM->uNandECC = BCH_T4;
            pSM->bIsMulticycle = FALSE;
            pSM->uSpareSize = 16;
            break;

        case 0x73:  // 16M
            pSM->uBlockPerFlash = 1023;
            pSM->uPagePerBlock = 32;
            pSM->uSectorPerBlock = 32;
            pSM->uPageSize = 512;
            pSM->uNandECC = BCH_T4;
            pSM->bIsMulticycle = FALSE;
            pSM->uSpareSize = 16;
            break;

        /* page size 2KB */
        case 0xf1:  // 128M
				case 0xd1:  // 128M
            pSM->uBlockPerFlash = 1023;
            pSM->uPagePerBlock = 64;
            pSM->uSectorPerBlock = 256;
            pSM->uPageSize = 2048;
            pSM->uNandECC = BCH_T4;
            pSM->bIsMulticycle = FALSE;
            pSM->uSpareSize = 64;
            break;

        case 0xda:  // 256M
            if ((tempID[3] & 0x33) == 0x11)
            {
                pSM->uBlockPerFlash = 2047;
                pSM->uPagePerBlock = 64;
                pSM->uSectorPerBlock = 256;
            }
            else if ((tempID[3] & 0x33) == 0x21)
            {
                pSM->uBlockPerFlash = 1023;
                pSM->uPagePerBlock = 128;
                pSM->uSectorPerBlock = 512;
            }
            pSM->uPageSize = 2048;
            pSM->uNandECC = BCH_T4;
            pSM->bIsMulticycle = TRUE;
            pSM->uSpareSize = 64;
            break;

        case 0xdc:  // 512M
            if((tempID[0]==0x98) && (tempID[1]==0xDC) &&(tempID[2]==0x90)&&(tempID[3]==0x26)&&(tempID[4]==0x76))
            {
               pSM->uBlockPerFlash = 2047;
               pSM->uPagePerBlock = 64;
               pSM->uSectorPerBlock = 256; 
               pSM->uPageSize = 4096;
               pSM->uNandECC = BCH_T12;
               pSM->bIsMLCNand = TRUE;
               pSM->uSpareSize = 192;
               pSM->bIsMulticycle = TRUE;
               break;
            }
            else if ((tempID[3] & 0x33) == 0x11)
            {
                pSM->uBlockPerFlash = 4095;
                pSM->uPagePerBlock = 64;
                pSM->uSectorPerBlock = 256;
            }
            else if ((tempID[3] & 0x33) == 0x21)
            {
                pSM->uBlockPerFlash = 2047;
                pSM->uPagePerBlock = 128;
                pSM->uSectorPerBlock = 512;
            }
            pSM->uPageSize = 2048;
            pSM->uNandECC = BCH_T4;
            pSM->bIsMulticycle = TRUE;
            pSM->uSpareSize = 64;
            break;

