OpenNuvoton/NUC970_NuWriter/NuWriterFW/NuWriterFW/source/sm.c
        case 0xd3:  // 1024M
            if ((tempID[3] & 0x33) == 0x32)
            {
                pSM->uBlockPerFlash = 2047;
                pSM->uPagePerBlock = 128;
                pSM->uSectorPerBlock = 1024;    /* 128x8 */
                pSM->uPageSize = 4096;
                pSM->uNandECC = BCH_T8;
                pSM->uSpareSize = 128;
            }
            else if ((tempID[3] & 0x33) == 0x11)
            {
                pSM->uBlockPerFlash = 8191;
                pSM->uPagePerBlock = 64;
                pSM->uSectorPerBlock = 256;
                pSM->uPageSize = 2048;
                pSM->uNandECC = BCH_T4;
                pSM->uSpareSize = 64;
            }
            else if ((tempID[3] & 0x33) == 0x21)
            {
                pSM->uBlockPerFlash = 4095;
                pSM->uPagePerBlock = 128;
                pSM->uSectorPerBlock = 512;
                pSM->uPageSize = 2048;
                pSM->uNandECC = BCH_T4;
                pSM->uSpareSize = 64;
            }
            else if ((tempID[3] & 0x33) == 0x22)
            {
                pSM->uBlockPerFlash = 4095;
                pSM->uPagePerBlock = 64;
                pSM->uSectorPerBlock = 512; /* 64x8 */
                pSM->uPageSize = 4096;
                pSM->uNandECC = BCH_T8;
                pSM->uSpareSize = 128;
            }
            pSM->bIsMulticycle = TRUE;
            break;

        case 0xd5:  // 2048M
            // H27UAG8T2A
            if ((tempID[0]==0xAD)&&(tempID[2] == 0x94)&&(tempID[3] == 0x25))
            {
                pSM->uBlockPerFlash = 4095;
                pSM->uPagePerBlock = 128;
                pSM->uSectorPerBlock = 1024;    /* 128x8 */
                pSM->uPageSize = 4096;
                pSM->uNandECC = BCH_T12;
                pSM->bIsMulticycle = TRUE;
                pSM->uSpareSize = 224;
                break;
            }
            // 2011/7/28, To support Hynix H27UAG8T2B NAND flash
            else if ((tempID[0]==0xAD)&&(tempID[2]==0x94)&&(tempID[3]==0x9A))
            {
                pSM->uBlockPerFlash = 1023;        // block index with 0-base. = physical blocks - 1
                pSM->uPagePerBlock = 256;
                pSM->uPageSize = 8192;
                pSM->uSectorPerBlock = pSM->uPageSize / 512 * pSM->uPagePerBlock;
                pSM->uNandECC = BCH_T24;
                pSM->bIsMulticycle = TRUE;
                pSM->uSpareSize = 448;
                break;
            }
            // 2011/7/28, To support Toshiba TC58NVG4D2FTA00 NAND flash
            else if ((tempID[0]==0x98)&&(tempID[2]==0x94)&&(tempID[3]==0x32))
            {
                pSM->uBlockPerFlash = 2075;        // block index with 0-base. = physical blocks - 1
                pSM->uPagePerBlock = 128;
                pSM->uPageSize = 8192;
                pSM->uSectorPerBlock = pSM->uPageSize / 512 * pSM->uPagePerBlock;
                pSM->uNandECC = BCH_T24;
                pSM->bIsMulticycle = TRUE;
                pSM->uSpareSize = 376;
                break;
            }
            else if ((tempID[3] & 0x33) == 0x32)
            {
                pSM->uBlockPerFlash = 4095;
                pSM->uPagePerBlock = 128;
                pSM->uSectorPerBlock = 1024;    /* 128x8 */
                pSM->uPageSize = 4096;
                pSM->uNandECC = BCH_T8;
                pSM->bIsMLCNand = TRUE;
                pSM->uSpareSize = 128;
            }
            else if ((tempID[3] & 0x33) == 0x11)
            {
                pSM->uBlockPerFlash = 16383;
                pSM->uPagePerBlock = 64;
                pSM->uSectorPerBlock = 256;
                pSM->uPageSize = 2048;
                pSM->uNandECC = BCH_T4;
                pSM->bIsMLCNand = FALSE;
                pSM->uSpareSize = 64;
            }
            else if ((tempID[3] & 0x33) == 0x21)
            {
                pSM->uBlockPerFlash = 8191;
                pSM->uPagePerBlock = 128;
                pSM->uSectorPerBlock = 512;
                pSM->uPageSize = 2048;
                pSM->uNandECC = BCH_T4;
                pSM->bIsMLCNand = TRUE;
                pSM->uSpareSize = 64;
            }
            pSM->bIsMulticycle = TRUE;
            break;

        default:
            // 2017/3/21, To support Micron MT29F32G08CBACA NAND flash
            if ((tempID[0]==0x2C)&&(tempID[1]==0x68)&&(tempID[2]==0x04)&&(tempID[3]==0x4A)&&(tempID[4]==0xA9))
            {
                pSM->uBlockPerFlash  = 4095;        // block index with 0-base. = physical blocks - 1
                pSM->uPagePerBlock   = 256;
                pSM->uSectorPerBlock = pSM->uPageSize / 512 * pSM->uPagePerBlock;
                pSM->uPageSize       = 4096;
                pSM->uNandECC        = BCH_T24;
                pSM->bIsMulticycle   = TRUE;
                //pSM->uSpareSize      = 224;
                pSM->uSpareSize      = 188;
                pSM->bIsMLCNand      = TRUE;
                break;
            }
            IsID=1;
    }
    
            
            /* Using PowerOn setting*/
      u32PowerOn = inpw(REG_PWRON);
      if((u32PowerOn&0x3C0)!=0x3C0 )
            {
              const UINT16 BCH12_SPARE[3] = { 92,184,368};/* 2K, 4K, 8K */
              const UINT16 BCH15_SPARE[3] = {116,232,464};/* 2K, 4K, 8K */
              const UINT16 BCH24_SPARE[3] = { 90,180,360};/* 2K, 4K, 8K */
              unsigned int volatile gu_fmiSM_PageSize;
              unsigned int volatile g_u32ExtraDataSize;

              MSG_DEBUG("Using PoowerOn setting 0x%x\n",u32PowerOn);
              if ((u32PowerOn & 0xC0) != 0xC0)	/* PWRON[7:6] */
              {
                gu_fmiSM_PageSize = 1024 << (((u32PowerOn >> 6) & 0x3) + 1);
                switch(gu_fmiSM_PageSize)
                {
                  case 2048:
                    MSG_DEBUG("2KB\n");
                    break;
                  case 4096:
                    MSG_DEBUG("4KB\n");
                    break;
                  case 8192:
                    MSG_DEBUG("8KB\n");
                    break;
                }
              }else
                gu_fmiSM_PageSize=2048;
              
              if((u32PowerOn & 0x300) != 0x300)	/* PWRON[9:8] */
              {
                switch((u32PowerOn & 0x300))
                {
                  case 0x000:
                    MSG_DEBUG("T12\n");
                    g_u32ExtraDataSize = BCH12_SPARE[gu_fmiSM_PageSize >> 12] + 8;
                    pSM->uNandECC = BCH_T12;
                    break;
                  case 0x100:
                    MSG_DEBUG("T15\n");
                    g_u32ExtraDataSize = BCH15_SPARE[gu_fmiSM_PageSize >> 12] + 8;
                    pSM->uNandECC = BCH_T15;
                    break;
                  case 0x200:
                    MSG_DEBUG("T24\n");
                    g_u32ExtraDataSize = BCH24_SPARE[gu_fmiSM_PageSize >> 12] + 8;
                    pSM->uNandECC = BCH_T24;
                    break;
                }
              }else{
                MSG_DEBUG("T12\n");
                g_u32ExtraDataSize = BCH12_SPARE[gu_fmiSM_PageSize >> 12] + 8;
              }

              pSM->uBlockPerFlash  = Custom_uBlockPerFlash-1;        // block index with 0-base. = physical blocks - 1
              pSM->uPagePerBlock   = Custom_uPagePerBlock;
              pSM->uPageSize       = gu_fmiSM_PageSize;
              pSM->uSectorPerBlock = pSM->uPageSize / 512 * pSM->uPagePerBlock;
              pSM->bIsMulticycle   = TRUE;
              pSM->uSpareSize      = g_u32ExtraDataSize;
              pSM->bIsMLCNand      = TRUE;
    }else{
      if(IsID==1){
        MSG_DEBUG("SM ID not support!![%x][%x]\n", tempID[0], tempID[1]);
        return Fail;
          }
    }

    MSG_DEBUG("SM ID [%x][%x][%x][%x]\n", tempID[0], tempID[1], tempID[2], tempID[3]);
    return Successful;
}

/*-----------------------------------------------------------------------------
 * 2011/7/28 by CJChen1@nuvoton.com, To issue command and address to NAND flash chip
 *  to order NAND flash chip to prepare the data or RA data at chip side and wait FMI to read actually.
 *  Support large page size 2K / 4K / 8K.
 *  INPUT: ucColAddr = 0 means prepare data from begin of page;
 *                   = <page size> means prepare RA data from begin of spare area.
 *---------------------------------------------------------------------------*/
INT fmiSM2BufferM_large_page(UINT32 uPage, UINT32 ucColAddr)
{
	// clear R/B flag
    while(!(inpw(REG_SMISR) & 0x40000));
    outpw(REG_SMISR, 0x400);

	outpw(REG_SMCMD, 0x00);		// read command
	outpw(REG_SMADDR, ucColAddr);	                // CA0 - CA7
	outpw(REG_SMADDR, (ucColAddr >> 8) & 0xFF);	    // CA8 - CA11
	outpw(REG_SMADDR, uPage & 0xff);	            // PA0 - PA7

