OpenNuvoton/NUC970_NuWriter/NuWriterFW/NuWriterFW/source/sm.c
	outpw(REG_SMCMD, 0x70);		    // status read command
	if (inpw(REG_SMDATA) & 0x01)	// 1:fail; 0:pass
	{
		sysprintf("ERROR: fmiSM_Write_large_page(): data error!!\n");
		return FMI_SM_STATE_ERROR;
	}
	return 0;
}

INT fmiSM_Write_large_page_oob2(UINT32 uSector, UINT32 ucColAddr, UINT32 uSAddr){
  UINT32 readlen,i;
  
  readlen=pSM->uPageSize+pSM->uSpareSize;
  outpw(REG_SMCMD,  0x80);  // serial data input command
  outpw(REG_SMADDR, 0x00);  // CA0 - CA7
  outpw(REG_SMADDR, 0x00);  // CA8 - CA12
  
  outpw(REG_SMADDR, uSector & 0xff);                      // PA0 - PA7
  outpw(REG_SMADDR, ((uSector >> 8) & 0xff));  // PA8 - PA15
  outpw(REG_SMADDR, ((uSector >> 16) & 0xff));            // PA16 - PA17
  outpw(REG_SMADDR, ((uSector >> 24) & 0xff)|0x80000000);
  MSG_DEBUG("readlen=%d\n",readlen);
  for (i=0; i<readlen; i++)
      outpw(REG_SMDATA, ((unsigned char *)uSAddr)[i]);

  outpw(REG_SMCMD, 0x10);               // auto program command
  
  if (!fmiSMCheckRB())
    return FMI_SM_RB_ERR;
  
  return 0;
}

INT fmiSM_Write_large_page(UINT32 uSector, UINT32 ucColAddr, UINT32 uSAddr)
{
	outpw(REG_NAND_DMACSAR, uSAddr);	// set DMA transfer starting address

	// set the spare area configuration
	/* write byte 2050, 2051 as used page */
	outpw(REG_SMRA0, 0x0000FFFF);

	// clear R/B flag
    while(!(inpw(REG_SMISR) & 0x40000));
    outpw(REG_SMISR, 0x400);

	// send command
	outpw(REG_SMCMD, 0x80);		                // serial data input command
	outpw(REG_SMADDR, ucColAddr);	            // CA0 - CA7
	outpw(REG_SMADDR, (ucColAddr >> 8) & 0x3f);	// CA8 - CA12
	outpw(REG_SMADDR, uSector & 0xff);	        // PA0 - PA7

	if (!pSM->bIsMulticycle)
		outpw(REG_SMADDR, ((uSector >> 8) & 0xff)|0x80000000);  // PA8 - PA15
	else
	{
		outpw(REG_SMADDR, (uSector >> 8) & 0xff);		    // PA8 - PA15
		outpw(REG_SMADDR, ((uSector >> 16) & 0xff)|0x80000000); // PA16 - PA17
	}

    outpw(REG_SMISR, 0x1);	        // clear DMA flag
    outpw(REG_SMISR, 0x4);	        // clear ECC_FIELD flag
    outpw(REG_SMISR, 0x8);	        // clear Region Protect flag
	outpw(REG_SMCSR, inpw(REG_SMCSR) | 0x10);    // auto write redundancy data to NAND after page data written
	outpw(REG_SMCSR, inpw(REG_SMCSR) | 0x4);     // begin to write one page data to NAND flash

	while(1)
	{
		if (inpw(REG_SMISR) & 0x1)         // wait to finish DMAC transfer.
            break;
	}

    outpw(REG_SMISR, 0x1);  // clear DMA flag
	outpw(REG_SMCMD, 0x10);	// auto program command

	if (!fmiSMCheckRB())
		return FMI_SM_RB_ERR;

    //--- check Region Protect result
    if (inpw(REG_SMISR) & 0x8)
    {
    sysprintf("ERROR: fmiSM_Write_large_page(): region write protect detected!!\n");
        outpw(REG_SMISR, 0x8);      // clear Region Protect flag
      return Fail;
  }

  outpw(REG_SMCMD, 0x70);		    // status read command
  if (inpw(REG_SMDATA) & 0x01)	// 1:fail; 0:pass
  {
    sysprintf("ERROR: fmiSM_Write_large_page(): data error!!\n");
    return FMI_SM_STATE_ERROR;
  }
  return 0;
}


static void fmiSM_CorrectData_BCH(UINT8 ucFieidIndex, UINT8 ucErrorCnt, UINT8* pDAddr)
{
    UINT32 uaData[24], uaAddr[24];
	UINT32 uaErrorData[4];
	UINT8  ii, jj;
	UINT32 uPageSize;
	UINT32 field_len, padding_len, parity_len;
	UINT32 total_field_num;
    UINT8  *smra_index;

    //--- assign some parameters for different BCH and page size
    switch (inpw(REG_SMCSR) & 0x7c0000)
    {
        case BCH_T24:
            field_len   = 1024;
            padding_len = BCH_PADDING_LEN_1024;
            parity_len  = BCH_PARITY_LEN_T24;
            break;
        case BCH_T15:
            field_len   = 512;
            padding_len = BCH_PADDING_LEN_512;
            parity_len  = BCH_PARITY_LEN_T15;
            break;
        case BCH_T12:
            field_len   = 512;
            padding_len = BCH_PADDING_LEN_512;
            parity_len  = BCH_PARITY_LEN_T12;
            break;
        case BCH_T8:
            field_len   = 512;
            padding_len = BCH_PADDING_LEN_512;
            parity_len  = BCH_PARITY_LEN_T8;
            break;
        case BCH_T4:
            field_len   = 512;
            padding_len = BCH_PADDING_LEN_512;
            parity_len  = BCH_PARITY_LEN_T4;
            break;
        default:
            sysprintf("ERROR: fmiSM_CorrectData_BCH(): invalid SMCR_BCH_TSEL = 0x%08X\n", (UINT32)(inpw(REG_SMCSR) & 0x7c0000));
            return;
    }

	uPageSize = inpw(REG_SMCSR) & 0x30000;
    switch (uPageSize)
    {
        case 0x30000: total_field_num = 8192 / field_len; break;
        case 0x20000: total_field_num = 4096 / field_len; break;
        case 0x10000: total_field_num = 2048 / field_len; break;
        case 0x00000: total_field_num =  512 / field_len; break;
        default:
            sysprintf("ERROR: fmiSM_CorrectData_BCH(): invalid SMCR_PSIZE = 0x%08X\n", uPageSize);
            return;
    }

    //--- got valid BCH_ECC_DATAx and parse them to uaData[]
    // got the valid register number of BCH_ECC_DATAx since one register include 4 error bytes
    jj = ucErrorCnt/4;
	jj ++;
	if (jj > 6)
	    jj = 6;     // there are 6 BCH_ECC_DATAx registers to support BCH T24

    for(ii=0; ii<jj; ii++)
    {
		uaErrorData[ii] = inpw(REG_BCH_ECC_DATA0 + ii*4);
	}

    for(ii=0; ii<jj; ii++)
    {
	    uaData[ii*4+0] = uaErrorData[ii] & 0xff;
	    uaData[ii*4+1] = (uaErrorData[ii]>>8) & 0xff;
	    uaData[ii*4+2] = (uaErrorData[ii]>>16) & 0xff;
	    uaData[ii*4+3] = (uaErrorData[ii]>>24) & 0xff;
	}

    //--- got valid REG_BCH_ECC_ADDRx and parse them to uaAddr[]
    // got the valid register number of REG_BCH_ECC_ADDRx since one register include 2 error addresses
    jj = ucErrorCnt/2;
    jj ++;
	if (jj > 12)
	    jj = 12;    // there are 12 REG_BCH_ECC_ADDRx registers to support BCH T24

    for(ii=0; ii<jj; ii++)
    {
	    uaAddr[ii*2+0] = inpw(REG_BCH_ECC_ADDR0 + ii*4) & 0x07ff;   // 11 bits for error address
	    uaAddr[ii*2+1] = (inpw(REG_BCH_ECC_ADDR0 + ii*4)>>16) & 0x07ff;
    }

