OpenNuvoton/NUC970_NuWriter/NuWriterFW/NuWriterFW/source/sm.c
    //--- pointer to begin address of field that with data error
    pDAddr += (ucFieidIndex-1) * field_len;

    //--- correct each error bytes
    for(ii=0; ii<ucErrorCnt; ii++)
    {
        // for wrong data in field
    	if (uaAddr[ii] < field_len)
    	{
  	        sysprintf("BCH error corrected for data: address 0x%08X, data [0x%02X] --> ",
  	            pDAddr+uaAddr[ii], *(pDAddr+uaAddr[ii]));

  	        *(pDAddr+uaAddr[ii]) ^= uaData[ii];

  	        sysprintf("[0x%02X]\n", *(pDAddr+uaAddr[ii]));
  	    }
  	    // for wrong first-3-bytes in redundancy area
		else if (uaAddr[ii] < (field_len+3))
		{
			uaAddr[ii] -= field_len;
			uaAddr[ii] += (parity_len*(ucFieidIndex-1));    // field offset

  	        sysprintf("BCH error corrected for 3 bytes: address 0x%08X, data [0x%02X] --> ",
  	            (UINT8 *)REG_SMRA0+uaAddr[ii], *((UINT8 *)REG_SMRA0+uaAddr[ii]));

  	        *((UINT8 *)REG_SMRA0+uaAddr[ii]) ^= uaData[ii];

  	        sysprintf("[0x%02X]\n", *((UINT8 *)REG_SMRA0+uaAddr[ii]));
    	}
    	// for wrong parity code in redundancy area
    	else
    	{
    	    // BCH_ERR_ADDRx = [data in field] + [3 bytes] + [xx] + [parity code]
    	    //                                   |<--     padding bytes      -->|
    	    // The BCH_ERR_ADDRx for last parity code always = field size + padding size.
    	    // So, the first parity code = field size + padding size - parity code length.
    	    // For example, for BCH T12, the first parity code = 512 + 32 - 23 = 521.
    	    // That is, error byte address offset within field is
    	    uaAddr[ii] = uaAddr[ii] - (field_len + padding_len - parity_len);

            // smra_index point to the first parity code of first field in register SMRA0~n
            smra_index = (UINT8 *)
                         (REG_SMRA0 + (inpw(REG_SMREACTL) & 0x1ff) - // bottom of all parity code -
                          (parity_len * total_field_num)             // byte count of all parity code
                         );

            // final address = first parity code of first field +
            //                 offset of fields +
            //                 offset within field
  	        sysprintf("BCH error corrected for parity: address 0x%08X, data [0x%02X] --> ",
  	            smra_index + (parity_len * (ucFieidIndex-1)) + uaAddr[ii],
  	            *((UINT8 *)smra_index + (parity_len * (ucFieidIndex-1)) + uaAddr[ii]));
  	        *((UINT8 *)smra_index + (parity_len * (ucFieidIndex-1)) + uaAddr[ii]) ^= uaData[ii];
  	        sysprintf("[0x%02X]\n", *((UINT8 *)smra_index + (parity_len * (ucFieidIndex-1)) + uaAddr[ii]));
        }
  	}   // end of for (ii<ucErrorCnt)
}


INT fmiSM_Read_move_data_ecc_check(UINT32 uDAddr)
{
	UINT32 uStatus;
	UINT32 uErrorCnt, ii, jj;
	volatile UINT32 uError = 0;
	UINT32 uLoop;

    //--- uLoop is the number of SM_ECC_STx should be check.
    //      One SM_ECC_STx include ECC status for 4 fields.
    //      Field size is 1024 bytes for BCH_T24 and 512 bytes for other BCH.
    switch (inpw(REG_SMCSR) & 0x30000)
    {
        case 0x10000:
            uLoop = 1;
            break;
        case 0x20000:
            if (inpw(REG_SMCSR) & 0x7c0000 == BCH_T24)
                uLoop = 1;
            else
                uLoop = 2;
            break;
        case 0x30000:
            if (inpw(REG_SMCSR) & 0x7c0000 == BCH_T24)
                uLoop = 2;
            else
                uLoop = 4;
            break;
        default:
            return -1;     // don't work for 512 bytes page
    }

	outpw(REG_NAND_DMACSAR, uDAddr);	// set DMA transfer starting address
    outpw(REG_SMISR, 0x1);	            // clear DMA flag
    outpw(REG_SMISR, 0x4);	            // clear ECC_FIELD flag
	outpw(REG_SMCSR, inpw(REG_SMCSR) | 0x2);    // begin to move data by DMA

    //--- waiting for DMA transfer stop since complete or ECC error
    // IF no ECC error, DMA transfer complete and make SMCR[DRD_EN]=0
    // IF ECC error, DMA transfer suspend     and make SMISR[ECC_FIELD_IF]=1 but keep keep SMCR[DRD_EN]=1
    //      If we clear SMISR[ECC_FIELD_IF] to 0, DMA transfer will resume.
    // So, we should keep wait if DMA not complete (SMCR[DRD_EN]=1) and no ERR error (SMISR[ECC_FIELD_IF]=0)
	while((inpw(REG_SMCSR) & 0x2) && ((inpw(REG_SMISR) & 0x4)==0))
	    ;

    //--- DMA transfer completed or suspend by ECC error, check and correct ECC error
    while(1)
    {
        if (inpw(REG_SMISR) & 0x4)
        {
            for (jj=0; jj<uLoop; jj++)
            {
                uStatus = inpw(REG_SMECC_ST0+jj*4);
                if (!uStatus)
                    continue;   // no error on this register for 4 fields
                // ECC error !! Check 4 fields. Each field has 512 bytes data
                for (ii=1; ii<5; ii++)
                {
                    if (!(uStatus & 0x3))     // no error for this field
                    {
                        uStatus >>= 8;  // next field
                        continue;
                    }

                    if ((uStatus & 0x3)==0x01)  // correctable error in field (jj*4+ii)
                    {
                        // 2011/8/17 by CJChen1@nuvoton.com, mask uErrorCnt since Fx_ECNT just has 5 valid bits
                        uErrorCnt = (uStatus >> 2) & 0x1F;
                        fmiSM_CorrectData_BCH(jj*4+ii, uErrorCnt, (UINT8*)uDAddr);
                        sysprintf("Warning: Field %d have %d BCH error. Corrected!!\n", jj*4+ii, uErrorCnt);
                        break;
                    }
                    else if (((uStatus & 0x3)==0x02) ||
                             ((uStatus & 0x3)==0x03)) // uncorrectable error or ECC error in 1st field
                    {
                        sysprintf("ERROR: Field %d encountered uncorrectable BCH error!!\n", jj*4+ii);
                        uError = 1;
                        break;
                    }
                    uStatus >>= 8;  // next field
                }
            }
            outpw(REG_SMISR, 0x4);	   	// clear ECC_FIELD_IF to resume DMA transfer
        }

        if (inpw(REG_SMISR) & 0x1)      // wait to finish DMAC transfer.
        {
            if ( !(inpw(REG_SMISR) & 0x4) )
                break;
        }
    }   // end of while(1)

